### To read the uploaded CSV file

In [12]:
import pandas as pd
dsdata = pd.read_csv("sales_data.csv")

### To Check the rows and columns in a dataset

In [13]:
dsdata.shape

(5, 5)

In [14]:
dsdata

   SaleID  Product_ID  Quantity  Price    SaleDate
0       1         101         2  19.99  2024-11-01
1       2         102         1  29.99  2024-11-02
2       3         103         3    NaN  2024-11-03
3       4         101         5  19.99  2024-11-04
4       5         104         2  39.99  2024-11-05

### To overview the null values and data type

In [15]:
dsdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   SaleID      5 non-null      int64
 1   Product_ID  5 non-null      int64
 2   Quantity    5 non-null      int64
 3   Price       4 non-null      float64
 4   SaleDate    5 non-null      object
dtypes: float64(1), int64(3), object(1)
memory usage: 332.0+ bytes

### To convert object in data type to String

In [16]:
dsdata =dsdata.convert_dtypes()

In [17]:
dsdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   SaleID      5 non-null      Int64
 1   Product_ID  5 non-null      Int64
 2   Quantity    5 non-null      Int64
 3   Price       4 non-null      Float64
 4   SaleDate    5 non-null      string
dtypes: Float64(1), Int64(3), string(1)
memory usage: 352.0 bytes

### To confirm the sum of missing values

In [18]:
dsdata.isna().sum()

SaleID        0
Product_ID    0
Quantity      0
Price         1
SaleDate      0
dtype: int64

### To Calcualte the mean for the missng field of the column Price

In [19]:
meanv = dsdata["Price"].mean()

In [20]:
meanv

27.490000000000002

### To fill the missing value with the average value

In [21]:
dsdata["Price"].fillna(meanv,inplace=True)

C:\Users\rizwa\AppData\Local\Temp\ipykernel_8044\2122611850.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dsdata["Price"].fillna(meanv,inplace=True)

In [22]:
dsdata

   SaleID  Product_ID  Quantity  Price    SaleDate
0       1         101         2  19.99  2024-11-01
1       2         102         1  29.99  2024-11-02
2       3         103         3  27.49  2024-11-03
3       4         101         5  19.99  2024-11-04
4       5         104         2  39.99  2024-11-05

### To check Duplicates

In [23]:
dsdata.duplicated().sum()

0

In [24]:
dsdata

   SaleID  Product_ID  Quantity  Price    SaleDate
0       1         101         2  19.99  2024-11-01
1       2         102         1  29.99  2024-11-02
2       3         103         3  27.49  2024-11-03
3       4         101         5  19.99  2024-11-04
4       5         104         2  39.99  2024-11-05

### To Read the Excel File

In [25]:
import pandas as pd
dsdata1 = pd.read_excel("product_inventory.xlsx")

In [26]:
dsdata1

   ProductID    ProductName  Stock
0        101       Widget A     10
1        102       Gadget B      5
2        103  Thingamajig C      7
3        104    Doohickey D      8
4        105  Contraption E      3

In [27]:
dsdata1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    5 non-null      int64
 1   ProductName  5 non-null      object
 2   Stock        5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

### To change the object to string in Dtype column

In [28]:
dsdata1 = dsdata1.convert_dtypes()

In [29]:
dsdata1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    5 non-null      Int64
 1   ProductName  5 non-null      string
 2   Stock        5 non-null      Int64
dtypes: Int64(2), string(1)
memory usage: 262.0 bytes

### To rename the column to aligned with Salesdata column

In [30]:
dsdata1.rename(columns={"ProductID" : "Product_ID"} , inplace = True)

In [31]:
dsdata1

   Product_ID    ProductName  Stock
0         101       Widget A     10
1         102       Gadget B      5
2         103  Thingamajig C      7
3         104    Doohickey D      8
4         105  Contraption E      3

In [32]:
dsdata1.duplicated().sum()

0

In [33]:
merged_data = pd.merge(dsdata, dsdata1, on='Product_ID', how='left')

### To merge the data

In [34]:
merged_data

   SaleID  Product_ID  Quantity  Price    SaleDate    ProductName  Stock
0       1         101         2  19.99  2024-11-01       Widget A     10
1       2         102         1  29.99  2024-11-02       Gadget B      5
2       3         103         3  27.49  2024-11-03  Thingamajig C      7
3       4         101         5  19.99  2024-11-04       Widget A     10
4       5         104         2  39.99  2024-11-05    Doohickey D      8

### TODO: Group by products names and calculate total quantities sold and prices for each product.

In [35]:
grouped_data = merged_data.groupby('ProductName').agg({'Price': 'sum', 'Quantity': 'sum'})

In [36]:
grouped_data

               Price  Quantity
ProductName
Doohickey D    39.99         2
Gadget B       29.99         1
Thingamajig C  27.49         3
Widget A       39.98         7

### Create a pivot table to summarise the quantity of products sold on each date, with product names as rows and dates as columns.

In [37]:
pivot_table = merged_data.pivot_table(index='ProductName', columns='SaleDate', values='Quantity', aggfunc='sum')

In [38]:
pivot_table

SaleDate       2024-11-01  2024-11-02  2024-11-03  2024-11-04  2024-11-05
ProductName
Doohickey D          <NA>        <NA>        <NA>        <NA>           2
Gadget B             <NA>           1        <NA>        <NA>        <NA>
Thingamajig C        <NA>        <NA>           3        <NA>        <NA>
Widget A                2        <NA>        <NA>           5        <NA>

### Replace NaN values with empty strings

In [39]:
pivot_table = pivot_table.astype("string").fillna('')

In [40]:
pivot_table

SaleDate      2024-11-01 2024-11-02 2024-11-03 2024-11-04 2024-11-05
ProductName
Doohickey D                                                        2
Gadget B                          1
Thingamajig C                                3
Widget A               2                                5